try:
    a = float(input('Оцените силу вашей душевной боли по шкале от 0 до 10: '))
    if a < 0:
        print('Значение не должно быть меньше 0.')
    elif a == 0:
        print('Пожалуйста, закройте тест. Поздравляем, он вам не нужен!')
    elif 0 < a < 0.7:
        print(
            'Кажется, вы испытываете легкое огорчение. Как человек в короткой поездке в метро, забывший дома наушники.')
    elif 0.7 <= a <= 4.2:
        print(
            'Вы встревожены - почти как человек, которому придется звонить по телефону, и это в эпоху мессенджеров! То самое чувство, когда начинаете нервно репетировать в голове диалог...')
    elif 4.2 < a <= 5.5:
        print(
            'Похоже, ваша тревога выше среднего. Это почти как переживать за кошку, которая выбежала на балкон одна: "А вдруг окно открыто? а вдруг она выпрыгнет? а если не успеет встать на лапы?"')
    elif 5.5 < a <= 6.9:
        print(
            'Вам сейчас почти так же как в ночь перед экзаменом: вы только вчера узнали, что в течение семестра была дисциплина "Теоретическая грамматика китайского языка", а вы изучали итальянский".')
    elif 6.9 < a <= 8.0:
        print(
            'Ваше состояние похоже на самочувствие разработчика, который остался без копии кода в день, когда git перестал работать.')
    elif 8.0 < a < 10:
        print('Вас переполняет душевная боль. Кажется, вы испытываете два состояния: молчать и кричать.')
    elif a >= 10:
        print('Пожалуйста, возьмите телефон и позвоните по 8495051.')
except ValueError:
    print('Повторите снова.')
